#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.ДатаОкончания.Видимость      = ЗначениеЗаполнено(Объект.ДатаОкончания);
	Элементы.Серия.Видимость              = ЗначениеЗаполнено(Объект.Серия);
	Элементы.ИдентификаторВЕТИС.Видимость = ЗначениеЗаполнено(Объект.ИдентификаторВЕТИС);
	Элементы.ВидДокумента.Видимость       = ЗначениеЗаполнено(Объект.ВидДокумента);
	
КонецПроцедуры

#КонецОбласти
