
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваДоверенности = Параметры.СвойстваДоверенности;
	
	МассивКодовНалоговыхОрганов = ДокументооборотСКОВызовСервера.КодыНалоговыхОргановМЧДФНС(
		СвойстваДоверенности.СсылкаМЧДФНС);
	КоличествоНалоговыхОрганов = МассивКодовНалоговыхОрганов.Количество();
	ФИОПредставителя = ДокументооборотСКОВызовСервера.ФИОМЧДФНС(СвойстваДоверенности.СсылкаМЧДФНС,
		Перечисления.СубъектыДоверенностиНалогоплательщика.ПредставительФЛ);
	
	Если КоличествоНалоговыхОрганов >= 10 Тогда
		КоличествоНалоговыхОргановТекстом = ОбщегоНазначенияЭДКОКлиентСервер.ПростоеСклонение(
			КоличествоНалоговыхОрганов,
			НСтр("ru = '%1 инспекция'"),
			НСтр("ru = '%1 инспекции'"),
			НСтр("ru = '%1 инспекций'"));
		КоличествоНалоговыхОргановТекстом = СтрШаблон(
			КоличествоНалоговыхОргановТекстом,
			Формат(КоличествоНалоговыхОрганов, "ЧДЦ=; ЧН="));
	КонецЕсли;
	
	Если СвойстваДоверенности.СтатусДоверенности =
		Перечисления.СтатусыМашиночитаемойДоверенностиКО.ИстекСрокДействия Тогда
		
		Элементы.ДекорацияСтатусДоверенности.Заголовок = Новый ФорматированнаяСтрока(
			НСтр("ru = 'Истек срок действия'") + " " + НСтр("ru = 'машиночитаемой'") + " ",
			Новый ФорматированнаяСтрока(НСтр("ru = 'доверенности'"),,,, "доверенность"),
			".");
	КонецЕсли;
	
	МаксимальноеКоличествоСимволовЗначения = 35;
	Элементы.ЗначенияРеквизитовДоверенности.Заголовок =
		?(СтрДлина(СвойстваДоверенности.НаименованиеОрганизации) > МаксимальноеКоличествоСимволовЗначения,
			Лев(СвойстваДоверенности.НаименованиеОрганизации, МаксимальноеКоличествоСимволовЗначения - 3) + "...",
			СвойстваДоверенности.НаименованиеОрганизации) + "
		|" + НСтр("ru = 'с'") + " "
			+ Формат(СвойстваДоверенности.ДатаВыдачи, "ДФ='дд.ММ.гггг'")
			+ ?(ЗначениеЗаполнено(СвойстваДоверенности.ДатаОкончания),
				" " + НСтр("ru = 'по'") + " " + Формат(СвойстваДоверенности.ДатаОкончания, "ДФ='дд.ММ.гггг'"), "")
			+ ?(НЕ ЗначениеЗаполнено(СвойстваДоверенности.ДатаОкончания)
				И ЗначениеЗаполнено(СвойстваДоверенности.СрокДействия), " " + СвойстваДоверенности.СрокДействия, "") + "
		|" + ?(СтрДлина(ФИОПредставителя) > МаксимальноеКоличествоСимволовЗначения,
			Лев(ФИОПредставителя, МаксимальноеКоличествоСимволовЗначения - 3) + "...", ФИОПредставителя) + "
		|" + ?(КоличествоНалоговыхОрганов = 0, НСтр("ru = 'Все'"),
			?(ЗначениеЗаполнено(КоличествоНалоговыхОргановТекстом), КоличествоНалоговыхОргановТекстом,
			СтрСоединить(МассивКодовНалоговыхОрганов, ", ")));
	
	Элементы.РегистрацииВНалоговомОрганеКПП.Видимость = РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(
		СвойстваДоверенности.ОрганизацияСсылка);
	Элементы.РегистрацииВНалоговомОрганеНаименованиеОрганизации.Видимость =
		СвойстваДоверенности.Организации.Количество() > 1;
	ОбновитьРегистрацииВНалоговомОргане(СвойстваДоверенности.РегистрацииВНалоговомОргане);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияСтатусДоверенностиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "доверенность" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПоказатьЗначение(, СвойстваДоверенности.СсылкаМЧДФНС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацииВНалоговомОрганеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацииВНалоговомОрганеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяСтрока = Неопределено ИЛИ ВыбраннаяСтрока < 0
		ИЛИ ВыбраннаяСтрока >= РегистрацииВНалоговомОргане.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", РегистрацииВНалоговомОргане[ВыбраннаяСтрока].РегистрацияСсылка);
	ОткрытьФорму(
		"Справочник.РегистрацииВНалоговомОргане.ФормаОбъекта",
		ПараметрыФормы,
		ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого Стр Из РегистрацииВНалоговомОргане Цикл
		Стр.Пометка = Истина;
	КонецЦикла;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого Стр Из РегистрацииВНалоговомОргане Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	ОтключитьМЧДФНС();
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИзменения(Команда)
	
	НоваяИгнорируемаяНедействительнаяМЧДФНС = СвойстваДоверенности.СсылкаМЧДФНС;
	ДокументооборотСКОВызовСервера.НедействительныеМЧДФНС(НоваяИгнорируемаяНедействительнаяМЧДФНС);
	Закрыть(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	КоличествоПомеченных = 0;
	Для каждого Стр Из Форма.РегистрацииВНалоговомОргане Цикл
		Если Стр.Пометка Тогда
			КоличествоПомеченных = КоличествоПомеченных + 1;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоПомеченныхТекстом = ОбщегоНазначенияЭДКОКлиентСервер.ПростоеСклонение(
		КоличествоПомеченных,
		НСтр("ru = 'Выбрана %1'"),
		НСтр("ru = 'Выбрано %1'"),
		НСтр("ru = 'Выбрано %1'"));
	
	КоличествоВсего = Форма.РегистрацииВНалоговомОргане.Количество();
	КоличествоВсегоТекстом = ОбщегоНазначенияЭДКОКлиентСервер.ПростоеСклонение(
		КоличествоВсего,
		НСтр("ru = '%2 инспекции'"),
		НСтр("ru = '%2 инспекций'"),
		НСтр("ru = '%2 инспекций'"));
	
	Форма.Элементы.ИтогПоТаблице.Заголовок = СтрШаблон(
		КоличествоПомеченныхТекстом + " " + НСтр("ru = 'из'") + " "  + КоличествоВсегоТекстом,
		КоличествоПомеченных,
		КоличествоВсего);
	Форма.Элементы.ФормаДа.Доступность = КоличествоПомеченных <> 0;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРегистрацииВНалоговомОргане(МассивРегистрацийВНалоговомОргане)
	
	Для каждого СвойстваРегистрации Из МассивРегистрацийВНалоговомОргане Цикл
		ПараметрыОтбора = Новый Структура("РегистрацияСсылка", СвойстваРегистрации.РегистрацияСсылка);
		МассивРегистраций = РегистрацииВНалоговомОргане.НайтиСтроки(ПараметрыОтбора);
		РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Добавить();
		РегистрацияВНалоговомОргане.Пометка = Истина;
		
		РегистрацияВНалоговомОргане.КодНалоговогоОргана 	= СвойстваРегистрации.КодРегистрации;
		РегистрацияВНалоговомОргане.КПП 					= СвойстваРегистрации.КППРегистрации;
		РегистрацияВНалоговомОргане.РегистрацияСсылка 		= СвойстваРегистрации.РегистрацияСсылка;
		РегистрацияВНалоговомОргане.ОрганизацияСсылка 		= СвойстваРегистрации.ОрганизацияСсылка;
		РегистрацияВНалоговомОргане.НаименованиеОрганизации = СвойстваРегистрации.НаименованиеОрганизации;
	КонецЦикла;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьМЧДФНС()
	
	Для каждого СвойстваРегистрации Из РегистрацииВНалоговомОргане Цикл
		Если СвойстваРегистрации.Пометка Тогда
			ОбъектРегистрации = СвойстваРегистрации.РегистрацияСсылка.ПолучитьОбъект();
			ОбъектРегистрации.Прочитать();
			ОбъектРегистрации.ДокументПредставителя = "";
			ОбъектРегистрации.Представитель = Неопределено;
			ОбъектРегистрации.УполномоченноеЛицоПредставителя = "";
			ОбъектРегистрации.Доверенность = Неопределено;
			ОбъектРегистрации.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
