////////////////////////////////////////////////////////////////////////////////
//
// Серверные процедуры и функции регламентированных отчетов общего назначения 
// с кешируемым результатом на время сеанса.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ДатаПлюсДниПоКалендарю(ДатаОт, КоличествоДней) Экспорт

	Результат = Новый Структура();
	Результат.Вставить("КалендарьЗаполнен", Ложь);
	Результат.Вставить("Дата", Дата(1,1,1));
	
	Попытка
		
		Календарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
		Дата = КалендарныеГрафики.ДатаПоКалендарю(
			Календарь, 
			ДатаОт, 
			КоличествоДней, 
			Истина);
			
		Результат.Дата = Дата;
		Результат.КалендарьЗаполнен = Истина;
	
	Исключение
		
		Дата = ТребованияФНС.ДатаПлюсДни(ДатаОт, КоличествоДней);
		Результат.Дата = Дата;
	
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаПлюсДни(ДатаОт, КоличествоДней) Экспорт

	День = 24*60*60;
	Результат = ДатаОт;
	
	ДельтаТекущая = 1;
	Пока ДельтаТекущая <= КоличествоДней Цикл
		
		Результат = Результат + День;
		
		Если НЕ ЭтоВыходной(Результат) Тогда
			ДельтаТекущая = ДельтаТекущая + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция РазностьДатПоКалендарю(ДатаНачала, ДатаОкончания) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("КалендарьЗаполнен", Ложь);
	Результат.Вставить("Дельта", 0);
	
	ЭтоПросрочка = 	ДатаОкончания < ДатаНачала;
	Если ЭтоПросрочка Тогда
		
		Дельта = ТребованияФНСПовтИсп.РазностьДат(ДатаОкончания, ДатаНачала);
		Результат.Дельта = -Дельта;
		Возврат Результат;
		
	КонецЕсли;
	
	Календарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	Попытка
	
		Дельта = КалендарныеГрафики.РазностьДатПоКалендарю(
			Календарь, 
			ДатаНачала, 
			ДатаОкончания, 
			Истина);
			
		// Т.к. между одинаковыми датами выдает результат 1
		Дельта = Дельта - 1;
		
		Результат.Дельта = Дельта;
		Результат.КалендарьЗаполнен = Истина;
	
	Исключение
		Дельта = ТребованияФНС.РазностьДатПоВыходным(ДатаНачала, ДатаОкончания);
		Результат.Дельта = Дельта;
	КонецПопытки; 
		
	Возврат Результат;
	
КонецФункции

Функция РазностьДат(ДатаНачала, ДатаОкончания) Экспорт
	
	День = 24*60*60;
	КоличествоДней = Цел((ДатаОкончания - ДатаНачала) / День);
	
	Возврат КоличествоДней;
	
КонецФункции

Функция РазностьДатПоВыходным(ДатаНачала, ДатаОкончания) Экспорт
	
	День = 24*60*60;
	ТекущийДень = ДатаНачала;
	
	КоличествоДней = 0;
	Пока НачалоДня(ТекущийДень) < НачалоДня(ДатаОкончания) Цикл
		
		ТекущийДень = ТекущийДень + День;
		
		Если НЕ ЭтоВыходной(ТекущийДень) Тогда
			КоличествоДней = КоличествоДней + 1;
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат КоличествоДней;
	
КонецФункции

Функция ЭтоВыходной(День) Экспорт

	Результат = 
		ДеньНедели(День) = 6
		ИЛИ ДеньНедели(День) = 7;
				
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКоличествоОтветовНаТребования(Ссылки, ТолькоОтправленные = Ложь, ВключаяНевозможностьПредоставленияДокументов = Истина) Экспорт
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Возврат КонтекстЭДОСервер.ПолучитьКоличествоОтветовНаТребования(Ссылки, ТолькоОтправленные, ВключаяНевозможностьПредоставленияДокументов);
	
КонецФункции

#КонецОбласти