
#Область СлужебныеПроцедурыИФункции

Функция ПубликуемаяСтруктураПредприятия(Позиции) Экспорт

	Возврат КабинетСотрудникаРасширенный.ПубликуемаяСтруктураПредприятия(Позиции);

КонецФункции

Процедура СоздатьВТШтатноеРасписание(МенеджерВТ, ИспользоватьШтатноеРасписание) Экспорт
	
	КабинетСотрудникаРасширенный.СоздатьВТШтатноеРасписание(МенеджерВТ, ИспользоватьШтатноеРасписание);
	
КонецПроцедуры

Функция ПодразделениеВСтруктуреПредприятия(Подразделение) Экспорт

	Возврат КабинетСотрудникаРасширенный.ПодразделениеВСтруктуреПредприятия(Подразделение);

КонецФункции

Функция ИменаКонтролируемыхПолей(Объект) Экспорт

	Возврат КабинетСотрудникаРасширенный.ИменаКонтролируемыхПолей(Объект);

КонецФункции

Процедура ОбъектПриЗаписи(Объект) Экспорт

	КабинетСотрудникаРасширенный.ОбъектПриЗаписи(Объект);

КонецПроцедуры

Процедура ОбъектПередЗаписью(Объект) Экспорт

	КабинетСотрудникаРасширенный.ОбъектПередЗаписью(Объект);

КонецПроцедуры

Функция ФотографииФизическихЛиц(ФизическиеЛица) Экспорт

	Возврат КабинетСотрудникаРасширенный.ФотографииФизическихЛиц(ФизическиеЛица);

КонецФункции

Функция ТипШтатноеРасписание() Экспорт

	Возврат КабинетСотрудникаРасширенный.ТипШтатноеРасписание();

КонецФункции

Функция ТипСтруктураПредприятия() Экспорт

	Возврат КабинетСотрудникаРасширенный.ТипСтруктураПредприятия();

КонецФункции

Функция ДанныеСтруктурыПредприятия(СписокОтбора) Экспорт

	Возврат КабинетСотрудникаРасширенный.ДанныеСтруктурыПредприятия(СписокОтбора);

КонецФункции

Функция ДанныеШтатногоРасписания(СписокОтбора) Экспорт

	Возврат КабинетСотрудникаРасширенный.ДанныеШтатногоРасписания(СписокОтбора);

КонецФункции

Процедура ДобавитьСотрудникиДляОбновленияПубликацииПравНаОтпуск(Сотрудник, ОбновлениеИБ) Экспорт

	КабинетСотрудникаРасширенный.ДобавитьСотрудникиДляОбновленияПубликацииПравНаОтпуск(Сотрудник, ОбновлениеИБ);

КонецПроцедуры

Процедура ОчиститьДанныеПриОтключенииСервиса() Экспорт

	КабинетСотрудникаРасширенный.ОчиститьДанныеПриОтключенииСервиса();

КонецПроцедуры

Процедура ОбновитьСтруктуруПредприятия() Экспорт

	КабинетСотрудникаРасширенный.ОбновитьСтруктуруПредприятия();

КонецПроцедуры

Функция НоваяПубликуемаяСтруктураПредприятияПозиций(Позиции) Экспорт

	Возврат КабинетСотрудникаРасширенный.НоваяПубликуемаяСтруктураПредприятияПозиций(Позиции);

КонецФункции

Функция ТипыОбрабатываемыхЗаявок() Экспорт

	Возврат КабинетСотрудникаРасширенный.ТипыОбрабатываемыхЗаявок();

КонецФункции

Процедура ОчиститьДанныеОбАктуальностиИнформацииОбОтпускеНепубликуемыхСотрудников(СотрудникиКПубликации) Экспорт 
	
	КабинетСотрудникаРасширенный.ОчиститьДанныеОбАктуальностиИнформацииОбОтпускеНепубликуемыхСотрудников(СотрудникиКПубликации);
	
КонецПроцедуры

Процедура ТекущиеКадровыеДанныеСотрудниковПередЗаписью(НаборЗаписей) Экспорт

	// в расширенной реализации не переопределяется

КонецПроцедуры

Процедура ТекущиеКадровыеДанныеСотрудниковПриЗаписи(НаборЗаписей) Экспорт

	КабинетСотрудникаРасширенный.ТекущиеКадровыеДанныеСотрудниковПриЗаписи(НаборЗаписей);

КонецПроцедуры

Функция ДоступнаяФункциональностьСервисаПоВерсииПриложения() Экспорт

	Возврат КабинетСотрудникаРасширенный.ДоступнаяФункциональностьСервисаПоВерсииПриложения();

КонецФункции

Функция КадровыеДанныеОбновляемыхСотрудников(МенеджерВТ) Экспорт
	
	Возврат КабинетСотрудникаРасширенный.КадровыеДанныеОбновляемыхСотрудников(МенеджерВТ);
	
КонецФункции

Процедура ДобавитьЭлементыБлокировкиПриОбновленииПубликации(Блокировка) Экспорт

	КабинетСотрудникаРасширенный.ДобавитьЭлементыБлокировкиПриОбновленииПубликации(Блокировка);

КонецПроцедуры

Процедура ЗарегистрироватьОбновлениеПубликуемыхОбъектов(ПубликуемыеОбъекты, ОбновитьВсе) Экспорт

	КабинетСотрудникаРасширенный.ЗарегистрироватьОбновлениеПубликуемыхОбъектов(ПубликуемыеОбъекты, ОбновитьВсе);

КонецПроцедуры

Процедура ОпубликоватьПрочиеИзменения(ПараметрыОбмена, БылиОшибки) Экспорт

	КабинетСотрудникаРасширенный.ОпубликоватьПрочиеИзменения(ПараметрыОбмена, БылиОшибки);

КонецПроцедуры

Процедура ОпубликоватьЗарегистрированныеИзменения(ПараметрыОбмена, ТаблицаИзменений, Результат) Экспорт

	КабинетСотрудникаРасширенный.ОпубликоватьЗарегистрированныеИзменения(ПараметрыОбмена, ТаблицаИзменений, Результат);

КонецПроцедуры

Процедура ЗарегистрироватьОбновлениеГрафиковРаботы() Экспорт

	КабинетСотрудникаРасширенный.ЗарегистрироватьОбновлениеГрафиковРаботы();

КонецПроцедуры

Функция ТипыОбъектовДляРучнойРегистрации() Экспорт
	
	Возврат КабинетСотрудникаРасширенный.ТипыОбъектовДляРучнойРегистрации();	
	
КонецФункции

Процедура ЗарегистрироватьОбновлениеДанныхГрафиковРаботы() Экспорт

	КабинетСотрудникаРасширенный.ЗарегистрироватьОбновлениеДанныхГрафиковРаботы();

КонецПроцедуры

Процедура ПлановыеУдержанияПередЗаписью(НаборЗаписей) Экспорт

	КабинетСотрудникаРасширенный.ПлановыеУдержанияПередЗаписью(НаборЗаписей);

КонецПроцедуры

Процедура ПлановыеУдержанияПриЗаписи(НаборЗаписей) Экспорт

	КабинетСотрудникаРасширенный.ПлановыеУдержанияПриЗаписи(НаборЗаписей);

КонецПроцедуры

Функция ЗарегистрироватьИзмененияПлановыхУдержаний() Экспорт

	Возврат КабинетСотрудникаРасширенный.ЗарегистрироватьИзмененияПлановыхУдержаний();

КонецФункции

Процедура ЗаполнитьНастройкиПрограммы(НастройкиПрограммы) Экспорт

	КабинетСотрудникаРасширенный.ЗаполнитьНастройкиПрограммы(НастройкиПрограммы);

КонецПроцедуры

Процедура ДобавитьЭлементБлокировкиСотрудникиДляОбновленияПубликацииПравНаОтпуск(Блокировка, ПубликацииПравНаОтпускБлокировка) Экспорт

	КабинетСотрудникаРасширенный.ДобавитьЭлементБлокировкиСотрудникиДляОбновленияПубликацииПравНаОтпуск(Блокировка, ПубликацииПравНаОтпускБлокировка)

КонецПроцедуры

Процедура ДобавитьЭлементыБлокировкиОбновлениеНастройкиПубликации(Блокировка) Экспорт

	КабинетСотрудникаРасширенный.ДобавитьЭлементыБлокировкиОбновлениеНастройкиПубликации(Блокировка);

КонецПроцедуры

Процедура ОчиститьДанныеПриПриОбновленииПубликации() Экспорт

	КабинетСотрудникаРасширенный.ОчиститьДанныеПриПриОбновленииПубликации();

КонецПроцедуры

Функция ДанныеСотрудниковДляПубликации(ПараметрыОбмена, МассивОтбора) Экспорт

	Возврат КабинетСотрудникаРасширенный.ДанныеСотрудниковДляПубликации(ПараметрыОбмена, МассивОтбора);

КонецФункции

Процедура ЗарегистрироватьИзмененияГрафиковРаботы(ТаблицаСотрудников) Экспорт

	КабинетСотрудникаРасширенный.ЗарегистрироватьИзмененияГрафиковРаботы(ТаблицаСотрудников);

КонецПроцедуры

Функция ТипГрафикРаботы() Экспорт

	Возврат КабинетСотрудникаРасширенный.ТипГрафикРаботы();

КонецФункции

Функция РуководителиПодразделенийОрганизаций(Подразделения) Экспорт

	Возврат КабинетСотрудникаРасширенный.РуководителиПодразделенийОрганизаций(Подразделения); 

КонецФункции

Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	КабинетСотрудникаРасширенный.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	
КонецПроцедуры

Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	
	КабинетСотрудникаРасширенный.ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны);
	
КонецПроцедуры

Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	КабинетСотрудникаРасширенный.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиФункциональностиСервиса(НастройкиФункциональности, ВерсияФормата) Экспорт

	КабинетСотрудникаРасширенный.ЗаполнитьНастройкиФункциональностиСервиса(НастройкиФункциональности, ВерсияФормата);

КонецПроцедуры

Функция ТипСсылкаВидыПредоставляемыхСотрудникамСправок() Экспорт
	
	Возврат КабинетСотрудникаРасширенный.ТипСсылкаВидыПредоставляемыхСотрудникамСправок();
	
КонецФункции

Функция СсылкаВидыПредоставляемыхСотрудникамСправок(Идентификатор) Экспорт
	
	Возврат КабинетСотрудникаРасширенный.СсылкаВидыПредоставляемыхСотрудникамСправок(Идентификатор);
	
КонецФункции

Функция ВидыПредоставляемыхСотрудникамСправок() Экспорт

	Возврат КабинетСотрудникаРасширенный.ВидыПредоставляемыхСотрудникамСправок();

КонецФункции

Функция ИспользоватьПубликациюВидовСправок() Экспорт

	Возврат КабинетСотрудникаРасширенный.ИспользоватьПубликациюВидовСправок();

КонецФункции

Процедура ВключитьСборГрафиковОтпусков() Экспорт

	КабинетСотрудникаРасширенный.ВключитьСборГрафиковОтпусков();

КонецПроцедуры

Функция ПреобразованиеJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт

	Возврат КабинетСотрудникаРасширенный.ПреобразованиеJSON(Свойство, Значение, ДополнительныеПараметры, Отказ);

КонецФункции

Функция ЗагрузитьГрафикиОтпусков(ПараметрыОбмена, ПолученныеИзменения, РезультатОбработки, ВерсияИзменений) Экспорт

	Возврат КабинетСотрудникаРасширенный.ЗагрузитьГрафикиОтпусков(ПараметрыОбмена, ПолученныеИзменения, РезультатОбработки, ВерсияИзменений);

КонецФункции

Функция ЗначениеИзЗначенияПоляСервиса(ЗначениеПоляСервиса, ИмяПоля) Экспорт

	Возврат КабинетСотрудникаРасширенный.ЗначениеИзЗначенияПоляСервиса(ЗначениеПоляСервиса, ИмяПоля);

КонецФункции



#КонецОбласти
