
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Организация") Тогда
		Организация = Параметры.Отбор.Организация;
	КонецЕсли;
	
	Элементы.Обновить.Видимость = ЗначениеЗаполнено(Организация);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	Организации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
	Оповещение = Новый ОписаниеОповещения("ОбновитьПослеОбновления", ЭтотОбъект);
	ЭлектронныйДокументооборотСФССКлиент.ПолучитьВходящиеСообщенияСЭДОФСС(
		Оповещение,
		Организации);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПослеОбновления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.БылиОшибки Тогда
		Для каждого ОшибкиПоОрганизации Из Результат.ОшибкиПоОрганизациям Цикл
			Для каждого ОписаниеОшибки Из ОшибкиПоОрганизации.Значение Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Получено = 0;
	Для каждого РезультатыПоОрганизации Из Результат.РезультатыПоОрганизациям Цикл
		Для каждого РезультатПоОрганизации Из РезультатыПоОрганизации.Значение Цикл
			Если РезультатПоОрганизации.Выполнено Тогда
				Получено = Получено + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Если Получено > 0 ИЛИ НЕ Результат.БылиОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Успешно получено сообщений СЭДО: %1'"),
			Строка(Получено)));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти