#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиПечатныхФорм() Экспорт
	
	Возврат РегистрыСведений.НастройкиПечатныхФормБЗК.Настройки();
	
КонецФункции

Функция СсылкаНаКодДокументаКадровогоМероприятия(КодДокументаКадровогоМероприятия) Экспорт
	
	Возврат Справочники.КодыДокументовКадровыхМероприятий.НайтиПоКоду(КодДокументаКадровогоМероприятия);
	
КонецФункции

Функция КодКадровогоДокументаПоУмолчанию() Экспорт
	
	Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.КодыДокументовКадровыхМероприятий.ИныеДокументы");
	
КонецФункции

Функция СвойстваКодаКадровогоДокумента(Знач КодДокументаКадровогоМероприятия = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(КодДокументаКадровогоМероприятия) Тогда
		КодДокументаКадровогоМероприятия = КодКадровогоДокументаПоУмолчанию();
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КодДокументаКадровогоМероприятия, "Код,НаименованиеПолное");
	
КонецФункции

#КонецОбласти