
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваДоверенности = Параметры.СвойстваДоверенности;
	
	МассивКодовНалоговыхОрганов = ДокументооборотСКОВызовСервера.КодыНалоговыхОргановМЧДФНС(
		СвойстваДоверенности.СсылкаМЧДФНС);
	КоличествоНалоговыхОрганов = МассивКодовНалоговыхОрганов.Количество();
	ФИОПредставителя = ДокументооборотСКОВызовСервера.ФИОМЧДФНС(СвойстваДоверенности.СсылкаМЧДФНС,
		Перечисления.СубъектыДоверенностиНалогоплательщика.ПредставительФЛ);
	
	Если КоличествоНалоговыхОрганов >= 10 Тогда
		КоличествоНалоговыхОргановТекстом = ОбщегоНазначенияЭДКОКлиентСервер.ПростоеСклонение(
			КоличествоНалоговыхОрганов,
			НСтр("ru = '%1 инспекция'"),
			НСтр("ru = '%1 инспекции'"),
			НСтр("ru = '%1 инспекций'"));
		КоличествоНалоговыхОргановТекстом = СтрШаблон(
			КоличествоНалоговыхОргановТекстом,
			Формат(КоличествоНалоговыхОрганов, "ЧДЦ=; ЧН="));
	КонецЕсли;
	
	МаксимальноеКоличествоСимволовЗначения = 35;
	Элементы.ЗначенияРеквизитовДоверенности.Заголовок =
		?(СтрДлина(СвойстваДоверенности.НаименованиеОрганизации) > МаксимальноеКоличествоСимволовЗначения,
			Лев(СвойстваДоверенности.НаименованиеОрганизации, МаксимальноеКоличествоСимволовЗначения - 3) + "...",
			СвойстваДоверенности.НаименованиеОрганизации) + "
		|" + НСтр("ru = 'с'") + " "
			+ Формат(СвойстваДоверенности.ДатаВыдачи, "ДФ='дд.ММ.гггг'")
			+ ?(ЗначениеЗаполнено(СвойстваДоверенности.ДатаОкончания),
				" " + НСтр("ru = 'по'") + " " + Формат(СвойстваДоверенности.ДатаОкончания, "ДФ='дд.ММ.гггг'"), "")
			+ ?(НЕ ЗначениеЗаполнено(СвойстваДоверенности.ДатаОкончания)
				И ЗначениеЗаполнено(СвойстваДоверенности.СрокДействия), " " + СвойстваДоверенности.СрокДействия, "") + "
		|" + ?(СтрДлина(ФИОПредставителя) > МаксимальноеКоличествоСимволовЗначения,
			Лев(ФИОПредставителя, МаксимальноеКоличествоСимволовЗначения - 3) + "...", ФИОПредставителя) + "
		|" + ?(КоличествоНалоговыхОрганов = 0, НСтр("ru = 'Все'"),
			?(ЗначениеЗаполнено(КоличествоНалоговыхОргановТекстом), КоличествоНалоговыхОргановТекстом,
			СтрСоединить(МассивКодовНалоговыхОрганов, ", ")));
	
	Элементы.РегистрацииВНалоговомОрганеКПП.Видимость = РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(
		СвойстваДоверенности.ОрганизацияСсылка);
	Если НЕ СвойстваДоверенности.ДоверенностьМожноПодставитьВРегистрацию Тогда
		Элементы.ФормаДа.Видимость = Ложь;
		Элементы.ФормаНет.Заголовок = НСтр("ru = 'Закрыть'");
		Элементы.ФормаНет.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	ОбновитьРегистрацииВНалоговомОргане(СвойстваДоверенности.РегистрацииВНалоговомОргане);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияСтатусДоверенностиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "доверенность" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПоказатьЗначение(, СвойстваДоверенности.СсылкаМЧДФНС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацииВНалоговомОрганеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацииВНалоговомОрганеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбраннаяСтрока = Неопределено ИЛИ ВыбраннаяСтрока < 0
		ИЛИ ВыбраннаяСтрока >= РегистрацииВНалоговомОргане.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("РегистрацииВНалоговомОрганеВыборПослеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Ключ", РегистрацииВНалоговомОргане[ВыбраннаяСтрока].РегистрацияСсылка);
	ОткрытьФорму(
		"Справочник.РегистрацииВНалоговомОргане.ФормаОбъекта",
		ПараметрыФормы,
		ЭтаФорма,,,,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого Стр Из РегистрацииВНалоговомОргане Цикл
		Стр.Пометка = Истина;
	КонецЦикла;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого Стр Из РегистрацииВНалоговомОргане Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРегистрациюВНалоговомОргане(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьРегистрациюВНалоговомОрганеПослеДобавления", ЭтотОбъект);
	ПараметрыЗаполнения = Новый Структура("Владелец", СвойстваДоверенности.ОрганизацияСсылка);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
	ОткрытьФорму(
		"Справочник.РегистрацииВНалоговомОргане.ФормаОбъекта",
		ПараметрыФормы,
		ЭтаФорма,,,,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	ПодключитьМЧДФНС(СвойстваДоверенности);
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИзменения(Команда)
	
	НоваяИгнорируемаяЗарегистрированнаяМЧДФНС = СвойстваДоверенности.СсылкаМЧДФНС;
	ДокументооборотСКОВызовСервера.ЗарегистрированныеМЧДФНС(НоваяИгнорируемаяЗарегистрированнаяМЧДФНС);
	Закрыть(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	КоличествоПомеченных = 0;
	Для каждого Стр Из Форма.РегистрацииВНалоговомОргане Цикл
		Если Стр.Пометка Тогда
			КоличествоПомеченных = КоличествоПомеченных + 1;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоПомеченныхТекстом = ОбщегоНазначенияЭДКОКлиентСервер.ПростоеСклонение(
		КоличествоПомеченных,
		НСтр("ru = 'Выбрана %1'"),
		НСтр("ru = 'Выбрано %1'"),
		НСтр("ru = 'Выбрано %1'"));
	
	КоличествоВсего = Форма.РегистрацииВНалоговомОргане.Количество();
	КоличествоВсегоТекстом = ОбщегоНазначенияЭДКОКлиентСервер.ПростоеСклонение(
		КоличествоВсего,
		НСтр("ru = '%2 инспекции'"),
		НСтр("ru = '%2 инспекций'"),
		НСтр("ru = '%2 инспекций'"));
	
	Форма.Элементы.ИтогПоТаблице.Заголовок = СтрШаблон(
		КоличествоПомеченныхТекстом + " " + НСтр("ru = 'из'") + " "  + КоличествоВсегоТекстом,
		КоличествоПомеченных,
		КоличествоВсего);
	Форма.Элементы.ФормаДа.Доступность = КоличествоПомеченных <> 0;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацииВНалоговомОрганеВыборПослеВыбора(Результат, ВыполняемоеОповещение) Экспорт
	
	ОбновитьРегистрацииВНалоговомОргане();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРегистрациюВНалоговомОрганеПослеДобавления(Результат, ВыполняемоеОповещение) Экспорт
	
	ОбновитьРегистрацииВНалоговомОргане();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРегистрацииВНалоговомОргане(МассивРегистрацийВНалоговомОргане = Неопределено)
	
	Если МассивРегистрацийВНалоговомОргане = Неопределено Тогда
		ТаблицаИлиМассивРегистраций = ДокументооборотСКОВызовСервера.РегистрацииВНалоговомОргане(
			СвойстваДоверенности.ОрганизацияСсылка);
	Иначе
		ТаблицаИлиМассивРегистраций = МассивРегистрацийВНалоговомОргане;
	КонецЕсли;
	
	МассивКодовНалоговыхОрганов = ДокументооборотСКОВызовСервера.КодыНалоговыхОргановМЧДФНС(
		СвойстваДоверенности.СсылкаМЧДФНС);
	
	НайденныеРегистрации = Новый Массив;
	Для каждого СвойстваРегистрации Из ТаблицаИлиМассивРегистраций Цикл
		Если МассивКодовНалоговыхОрганов.Количество() = 0
			ИЛИ МассивКодовНалоговыхОрганов.Найти(СвойстваРегистрации.КодРегистрации) <> Неопределено Тогда
			
			ПараметрыОтбора = Новый Структура("РегистрацияСсылка", СвойстваРегистрации.РегистрацияСсылка);
			МассивРегистраций = РегистрацииВНалоговомОргане.НайтиСтроки(ПараметрыОтбора);
			Если МассивРегистраций.Количество() = 0 Тогда
				РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Добавить();
				РегистрацияВНалоговомОргане.Пометка = Истина;
			Иначе
				РегистрацияВНалоговомОргане = МассивРегистраций[0];
			КонецЕсли;
			
			РегистрацияВНалоговомОргане.КодНалоговогоОргана = СвойстваРегистрации.КодРегистрации;
			РегистрацияВНалоговомОргане.КПП 				= СвойстваРегистрации.КППРегистрации;
			РегистрацияВНалоговомОргане.РегистрацияСсылка 	= СвойстваРегистрации.РегистрацияСсылка;
			НайденныеРегистрации.Добавить(СвойстваРегистрации.РегистрацияСсылка);
		КонецЕсли;
	КонецЦикла;
	
	КоличествоРегистраций = РегистрацииВНалоговомОргане.Количество();
	Для ИндексСКонца = 0 По КоличествоРегистраций - 1 Цикл
		ИндексРегистрации = КоличествоРегистраций - ИндексСКонца - 1;
		Если НайденныеРегистрации.Найти(РегистрацииВНалоговомОргане[ИндексРегистрации].РегистрацияСсылка) = Неопределено Тогда
			РегистрацииВНалоговомОргане.Удалить(ИндексРегистрации);
		КонецЕсли;
	КонецЦикла;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьМЧДФНС(СвойстваДоверенности)
	
	Для каждого СвойстваРегистрации Из РегистрацииВНалоговомОргане Цикл
		Если СвойстваРегистрации.Пометка Тогда
			ОбъектРегистрации = СвойстваРегистрации.РегистрацияСсылка.ПолучитьОбъект();
			ОбъектРегистрации.Прочитать();
			ОбъектРегистрации.ДокументПредставителя = НСтр("ru = 'Машиночитаемая доверенность'")
				+ ?(ЗначениеЗаполнено(СвойстваДоверенности.НомерДоверенности), " №" + СвойстваДоверенности.НомерДоверенности, "")
				+ ?(ЗначениеЗаполнено(СвойстваДоверенности.ДатаВыдачи), " " + НСтр("ru = 'от'") + " "
				+ Формат(СвойстваДоверенности.ДатаВыдачи, "ДФ='дд.ММ.гггг'") + " " + НСтр("ru = 'г.'"), "");
			ОбъектРегистрации.Представитель = СвойстваДоверенности.Представитель;
			ОбъектРегистрации.УполномоченноеЛицоПредставителя = СвойстваДоверенности.ФИОПредставителя;
			ОбъектРегистрации.Доверенность = СвойстваДоверенности.СсылкаМЧДФНС;
			ОбъектРегистрации.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
