
#Область ПрограммныйИнтерфейс

// Формирует таблицу документов со статусами проверки РНПТ в зависимости от переданных параметров поиска.
//
// Параметры:
//  ПараметрыПоиска - Структура с полями:
//    * Организация - СправочникСсылка - ссылка на организацию, по которой происходит поиск
//    * НачалоПериода - Дата - дата начала поиска
//    * КонецПериода - Дата - дата окончания поиска
//    * Контрагент - СправочникСсылка - контрагент по которому происходит поиск (может быть пустой)
//    * НастройкаОтображенияДокументов - Число (0 - все, 1 - с ошибками, 2 - без ошибок)
//    * РежимРасшифровки - Булево - признак, необходимый для получения сведений из отчета "снаружи"
//    * ЭтоВходящийДокумент - Булево - признак того, что нужно отбирать входящие документы
//
// Возвращаемое значение:
//  ТаблицаЗначений - см. текст запроса функции
//
Функция ДокументыСоСтатусомПроверкиРНПТ(ПараметрыПоискаДокументов) Экспорт
	
	Возврат Новый ТаблицаЗначений;
	
КонецФункции

// Добавляет дополнительные поля для проверки РНПТ.
//
// Параметры:
//  ТаблицаДанныеРНПТ - ТаблицаЗначений - таблица, которую необходимо дополнить реквизитами для проверки
//
Процедура ДобавитьДополнительныеКолонкиДляПроверки(ТаблицаДанныеРНПТ) Экспорт
	
КонецПроцедуры

// Заполняет дополнительные поля для проверки нужными значениями
//
// Параметры:
//  ДанныеРНПТ - ТаблицаЗначений - см.ПроверкаРНПТ.НовыйТаблицаДанныхРНПТ()
//  Параметры - ФормаКлиентскогоПриложения или Структура с полями для заполнения дополнительных колонок для проверки.
//
Процедура ЗаполнитьДополнительныеКолонкиДляПроверки(ДанныеРНПТ, Параметры) Экспорт
	
КонецПроцедуры

// Проверяет дополнительные колонки РНПТ.
//
// Параметры:
//  ПроверяемаяСтрока - Структура - строка с доп. полями по данным документа.
//  ЭталоннаяСтрока - Структура с доп. полями по данным ФНС.
//  ТолькоТекстОшибки - Булево - признак, указывающий, что процедура вызывается только для формирования текста ошибки.
//
Процедура ПроверитьДополнительныеКолонки(ПроверяемаяСтрока, ЭталоннаяСтрока, ТолькоТекстОшибки = Ложь) Экспорт
	
КонецПроцедуры

// Проверяет соответствует ли код РНПТ формату.
//
// Параметры:
//  КодРНПТ - Строка - проверяемый код
// Возвращаемое значение - Булево - истина если соответствует, ложь если не соответствует.
//
Функция РНПТСоответствуетФормату(КодРНПТ) Экспорт
	
	Возврат Истина;
	
КонецФункции

// Возвращает для документа какие табличные части могут быть с прослеживаемым товаром.
//
// Параметры:
//  ДокументОбъект - проверяемы документ
// Возвращаемое значение - Массив - наименование табличных частей с прослеживаемостью
//
Функция ТабличныеЧастиДокументаСПрослеживаемостью(ДокументОбъект) Экспорт
	
	ТабличныеЧастиДокументаСПрослеживаемостью = Новый Массив;
	
	Возврат ТабличныеЧастиДокументаСПрослеживаемостью;
	
КонецФункции

// Возвращает текст запроса для проверки РНПТ документов регламентным заданием.
//
// Возвращаемое значение - Строка - текст запроса
//
Функция ТекстЗапросаПроверкиРНПТРегЗаданием() Экспорт
	
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 0
	|	ДокументыКПроверке.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ДокументыКПроверке";
	
КонецФункции

// Возвращает тип справочника РНПТ.
//
// Возвращаемое значение - Тип - тип справочника РНПТ
//
Функция ТипСправочникаРНПТ() Экспорт
	
	Возврат Тип("СправочникСсылка.НомераГТД");
	
КонецФункции

// Ищет элемент справочника РНПТ по коду.
// 
// Параметры:
// КодРНПТ - строка - код РНПТ элемента справочника.
// 
// Возвращаемое значение - СправочникСсылка - ссылка на элемент справочника РНПТ
//
Функция РНПТПоКоду(КодРНПТ) Экспорт
	
	Возврат Справочники.НомераГТД.НайтиПоКоду(КодРНПТ);
	
КонецФункции

// Возвращает текст запроса для получения кода РНПТ.
//
// Возвращаемое значение - Строка - текст запроса
//
Функция ТекстПолученияКодаРНПТВЗапросе() Экспорт
	
	Возврат "ВЫРАЗИТЬ(ДанныеРНПТ.РНПТ КАК Справочник.НомераГТД).Код";
	
КонецФункции

// Удаляет повторяющиеся элементы массива.
//
// Параметры:
//  ОбрабатываемыйМассив - Массив - элементы произвольных типов, из которых удаляются неуникальные.
//
// Возвращаемое значение:
//   Массив      - элементы ОбрабатываемыйМассив после удаления лишних.
//
Функция УдалитьПовторяющиесяЭлементыМассива(ОбрабатываемыйМассив) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(ОбрабатываемыйМассив);
	
КонецФункции

// Проверяет есть ли прослеживаемые товары в документе
//
// Параметры:
// ДокументОбъект - документ, который требуется проверить
//
// Возвращаемое значение - Булево - признак того, что в документе есть прослеживаемые товары
//
Функция ЕстьПрослеживаемыеТовары(ДокументОбъект) Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
