#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Запись.ОбъектПубликации) = Тип("СправочникСсылка.Сотрудники") Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСотрудник;
	Иначе
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПрочиеОбъекты;
	КонецЕсли;
	
	ТипОбъекта = Строка(ТипЗнч(Запись.ОбъектПубликации));
	Элементы.ОбъектПубликации.Заголовок = Строка(ТипЗнч(Запись.ОбъектПубликации));;
	
	Элементы.ФизическоеЛицо.Видимость = ЗначениеЗаполнено(Запись.ФизическоеЛицо);
	Элементы.Позиция.Видимость = ЗначениеЗаполнено(Запись.Позиция);
	Элементы.Предупреждение.Видимость = ЗначениеЗаполнено(Запись.ОписаниеОшибки);
	Элементы.ОписаниеОшибки.Видимость = ЗначениеЗаполнено(Запись.ОписаниеБлокирующейОшибки);
	
	Если Запись.БлокирующаяОшибка Тогда
		ПояснениеОшибки = НСтр("ru = 'Объект не публикуется в сервисе из-за ошибок заполнения'");
	Иначе
		ПояснениеОшибки = НСтр("ru = 'Объект публикуется в сервисе, но некоторые свойства указаны некорректно'");
	КонецЕсли;
	
	Элементы.ДекорацияПояснениеОшибки.Заголовок = ПояснениеОшибки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьСписокОшибокЗаполненияКабинетСотрудника");
КонецПроцедуры


#КонецОбласти
