#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает результат обмена с кабинетом сотрудника.
//	Параметры:
//		РезультатОбмена - структура - результат обмена:
//			ДатаНачала - Дата - дата начала обмена;
//			ДатаОкончания - Дата - дата окончания обмена;
//			БылиОшибки - булево - если в ходе обмена были ошибки, то Истина.
Процедура ЗаписатьРезультатОбмена(РезультатОбмена) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РезультатОбменаКабинетСотрудника.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РезультатОбмена);
	МенеджерЗаписи.ИндексСобытия = 0;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращает результат последнего обмена с кабинетом сотрудника
//	Возвращаемое значение:
//		Структура - результат обмена:
//			ДатаНачала - Дата - дата начала обмена;
//			ДатаОкончания - Дата - дата окончания обмена;
//			БылиОшибки - булево - если в ходе обмена были ошибки, то Истина.
Функция РезультатОбмена() Экспорт
	
	Настройки = РегистрыСведений.РезультатОбменаКабинетСотрудника.СоздатьМенеджерЗаписи();
	Настройки.ИндексСобытия = 0;
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.РезультатОбменаКабинетСотрудника);
							
	Возврат СтруктураНастроек;
	
КонецФункции

// Записывает результат обработки обсуждений.
//	Параметры:
//		РезультатОбработки - структура - результат обмена:
//			ДатаНачала - Дата - дата начала обмена;
//			ДатаОкончания - Дата - дата окончания обмена;
//			БылиОшибки - булево - если в ходе обмена были ошибки, то Истина.
Процедура ЗаписатьРезультатОбработкиОбсуждений(РезультатОбработки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РезультатОбменаКабинетСотрудника.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РезультатОбработки);
	МенеджерЗаписи.ИндексСобытия = 1;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры


// Возвращает результат последней обработки новых обсуждений
//	Возвращаемое значение:
//		Структура - результат обмена:
//			ДатаНачала - Дата - дата начала обмена;
//			ДатаОкончания - Дата - дата окончания обмена;
//			БылиОшибки - булево - если в ходе обмена были ошибки, то Истина.
Функция РезультатОбработкиОбсуждений() Экспорт
	
	Настройки = РегистрыСведений.РезультатОбменаКабинетСотрудника.СоздатьМенеджерЗаписи();
	Настройки.ИндексСобытия = 1;
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.РезультатОбменаКабинетСотрудника);
							
	Возврат СтруктураНастроек;
	
КонецФункции


#КонецОбласти
	
#КонецЕсли


