
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ПоказатьИнформациюоСроках() Экспорт
	
	ОткрытьФорму(
		"Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.ФормаСрокиПредставления"
		,
		,
		,
		,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
	
Процедура ИзменитьСрокТребования(ТребованиеСсылка, ОповещениеЗавершения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура("Требование", ТребованиеСсылка);
	ОткрытьФорму(
		"Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.ИзменениеСрокаТребования", 
		ПараметрыФормы, 
		, 
		Истина,
		,
		,
		ОповещениеЗавершения);
		
	
КонецПроцедуры

Процедура ОткрытьКалендарь(СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Календарь = ТребованияФНСВызовСервера.ПроизводственныйКалендарь();
	ПоказатьЗначение(, Календарь);
	
КонецПроцедуры

Процедура ПодтвердитьПриемНескольких(Сейчас, КонтекстЭДОКлиент, Организация = Неопределено ) Экспорт
	
	Есть = ТребованияФНСВызовСервера.ЕстьТребующиеПодтверждения(Организация);
	
	Если Есть Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Сейчас", Сейчас);
		
		ОткрытьФорму(
			КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.ГрупповоеПодтверждениеПриема",
			ПараметрыФормы,,,,,
			,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	Иначе
		
		Если ЗначениеЗаполнено(Организация) Тогда
			Текст = НСтр("ru = 'По организаци %1 отсутствуют требования, прием которых нужно подтвердить'");
			Текст = СтрШаблон(Текст, Организация);
		Иначе
			Текст = НСтр("ru = 'Отсутствуют требования, прием которых нужно подтвердить'");
		КонецЕсли;
		ПоказатьПредупреждение(, Текст);
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
